package com.offcn.demo;

public class Demo_嵌套循环概述 {
    public static void main(String[] args) {
        /*for(初始表达式1;循环条件2;步进表达式7){
             for  ( 初始表达式3; 循环条件4;步进表达式6)
                    执行语句5;


         }
        *初始表达式1 点火 整个循环的开始
        循环条件2 如果为假  整儿循环结束如果为真
        执行循环语句  :是另一个循环
            初始表达式3 内层循环点火仪式
            循环条件4   :如果为真 执行语句5 如果为假 内层结束 外层继续;
            交给表达式7
            执行步骤
            123456 456 456...4未假 执行 72 3456 456 4为假...直到2为假的时候 整个循环结束


        *
        * */

    }

}
